Aliaszhang/GD32F103VC_IS61LV256AL/SOURCE/main.c
/*!
    \file    main.c
    \brief   EXMC SRAM demo

    \version 2014-12-26, V1.0.0, firmware for GD32F10x
    \version 2017-06-20, V2.0.0, firmware for GD32F10x
    \version 2018-07-31, V2.1.0, firmware for GD32F10x
    \version 2020-09-30, V2.2.0, firmware for GD32F10x
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f10x.h"
#include "systick.h"
#include <stdio.h>
#include <string.h>
#include "exmc_sram.h"

#define BUFFER_SIZE             200                 /*!< write or read buffer size */
#define WRITE_READ_ADDR         0x0200              /*!< SRAM write or read address */

// uint8_t txbuffer[BUFFER_SIZE] __attribute__((used, section(".RW_RAM1")));
uint8_t rxbuffer[BUFFER_SIZE];
uint16_t writereadstatus = 0;


static int uart_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_USART0);
 
    /* connect port to USARTx_Tx */
    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_9);

    /* connect port to USARTx_Rx */
    gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10);
    
    usart_deinit(USART0);
    usart_baudrate_set(USART0, 115200U);
    usart_word_length_set(USART0, USART_WL_8BIT);
    usart_stop_bit_set(USART0, USART_STB_1BIT);
    usart_parity_config(USART0, USART_PM_NONE);
    usart_hardware_flow_rts_config(USART0, USART_RTS_DISABLE);
    usart_hardware_flow_cts_config(USART0, USART_CTS_DISABLE);
    usart_receive_config(USART0, USART_RECEIVE_ENABLE);
    usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
    usart_enable(USART0);
    
    return 0;
}


/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
char try __attribute__((used, section(".RW_RAM1")));
int main(void)
{
    // uint16_t i = 0;
        
    try = 0x21;

    systick_config();
    
    // LED
    rcu_periph_clock_enable(RCU_GPIOB);
    gpio_init(GPIOB, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);
    
    /* config the USART */
    uart_init();
    /* config the EXMC access mode */
    printf("\r\n\nstart sram init\r\n");
    exmc_sram_init();
    
    printf("CK_SYS is %d\r\n", rcu_clock_freq_get(CK_SYS));
    printf("CK_AHB is %d\r\n", rcu_clock_freq_get(CK_AHB));
    printf("CK_APB1 is %d\r\n", rcu_clock_freq_get(CK_APB1));
    printf("CK_APB2 is %d\r\n", rcu_clock_freq_get(CK_APB2));


#if 0
    while (try--)
    {
        writereadstatus = 0;
        memset(rxbuffer, 0x0, BUFFER_SIZE);
        // rt_memset(txbuffer, 0x0, BUFFER_SIZE);
        /* fill txbuffer */
        // fill_buffer_8(txbuffer, BUFFER_SIZE, (try));
        memset(txbuffer, try, BUFFER_SIZE);
        /* write data to SRAM  */
        exmc_sram_writebuffer_8(txbuffer, WRITE_READ_ADDR, BUFFER_SIZE);
        /* read data from SRAM */
        exmc_sram_readbuffer_8(rxbuffer, WRITE_READ_ADDR, BUFFER_SIZE);
        /* compare two buffers */
        // for(i = 0;i < try;i++){
        //     if (rxbuffer[i] != txbuffer[i]){
        //         writereadstatus ++;
        //         break;
        //     }
        // }
        // if(writereadstatus){
        //     kprintf("\r\nSRAM test failed! %d\r\n", try);
        // }else
        {
            // kprintf("\r\nSRAM test successed! %d", try);
            printf("\r\nthe addr 0x%x test data is:\r\n", WRITE_READ_ADDR);
            for(i=0;i < BUFFER_SIZE; i++){
                printf("%02x ",rxbuffer[i]);
                if(((i+1)%50) == 0){
                    printf("\r\n");
                }
            }
            printf("\r\n");
        }
    }
#endif

    while(1)
    {
        gpio_bit_set(GPIOB, GPIO_PIN_0);
        delay_1ms(500);

        //memset(txbuffer, try, BUFFER_SIZE);
        //printf("txbuffer pointer addr = %p, data = %s\r\n", txbuffer, txbuffer);
        memset(rxbuffer, try, BUFFER_SIZE);
        printf("try pointer addr = %p, try = %d\r\n", &try, try++);
        // printf("txbuffer pointer addr = %p, data = %s\r\n", txbuffer, txbuffer);
        printf("rxbuffer pointer addr = %p, data = %s\r\n", rxbuffer, rxbuffer);
        if (try > 0x7E)
        {
            try = 0x21;
        }
        
        gpio_bit_reset(GPIOB, GPIO_PIN_0);
        delay_1ms(500);
    }
}

/* retarget the C library printf function to the USART */
int fputc(int ch, FILE *f)
{
    usart_data_transmit(USART0, (uint8_t) ch);
    while(RESET == usart_flag_get(USART0, USART_FLAG_TBE));

    return ch;
}
